// 1 Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

let numberStr ="";

for (let i = 20; i <= 30; i += 0.5) {
    if (i !== 30) numberStr +=`${i} `;
    if (i === 30) numberStr += `${i}`;
}
console.log(numberStr);

// 2 Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

const dollar = 27;
let exchange;

for (let i = 10; i <= 100; i += 10) {
    exchange = dollar * i;
    console.log(`У вас вийде ${exchange} гривень.`);
}

//3 Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

const N = 899;

for(let i = 1; i <= 100; i++) {
    if(i**2 < N) console.log(i);
}

//4 Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
const n = 13;

for(let i = 1; i <= n; i++){
    if(n%i !== 0){
        continue;
    }
    if (n%i === 0){
        console.log(`Це ціле число`);
    }
}

//5 Дане деяке число.
//Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. 
//(Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

const numb2 = 18;

if(numb2 % 3 ===0){
    console.log(`Це число можно одержати шляхом взведення числа 3 у ступінь`);
} else {
    console.log(`Це число не можно одержати шляхом взведення числа 3 у ступінь`);
}
